/******************************************************************************/
/* resource.c                                                                 */
/*                                                                            */
/* Этот файл содержит все основные модули и функции, необходимые для          */
/* управления ресурсами в OS class A                                          */
/*                                                                            */
/* Автор: Кожевников К.А.                                                     */
/*                                                                            */
/* Дата создания: 10 июля 2000 г.                                             */
/******************************************************************************/

#include "rtos_api.h"
#include "sys.h"

/******************************************************************************/
/* Функции API                                                                */
/******************************************************************************/

/* Захват ресурса */
void _Get (TResource priority)
{
   /* Система Wasp OS Lite не поддерживает управление ресурсами */
}

/* Освобождение ресурса */
void _Release (TResource priority)
{
   /* Система Wasp OS Lite не поддерживает управление ресурсами */
}
